CherryUSB/cherryusb_wch/usb_device/ch32h417qeu_usbhs/V3F/Peripheral/inc/ch32h417_usb.h
/* LINK_CTRL */
#define LINK_RX_TS_CFG_MASK         0xFF000000
#define LINK_TX_TS_CFG_MASK         0x00FF0000
 #define LINK_HOT_RESET             0x00010000
#define LINK_TX_LGO_U3              0x00008000
#define LINK_TX_LGO_U2              0x00004000
#define LINK_TX_LGO_U1              0x00002000
#define LINK_POLLING_EN             0x00001000
#define LINK_REG_ROUT_EN            0x00000800
#define LINK_LUP_LDN_EN             0x00000400
#define LINK_TX_UX_EXIT             0x00000200
#define LINK_TX_WARM_RESET          0x00000100
#define LINK_GO_RX_DET              0x00000080
#define LINK_GO_RECOVERY            0x00000040
#define LINK_GO_INACTIVE            0x00000020
#define LINK_GO_DISABLED            0x00000010
 #define LINK_PD_MODE_MASK           0x00000003
#define LINK_P0_MODE                0x00000000
#define LINK_P1_MODE                0x00000001
#define LINK_P2_MODE                0x00000002
#define LINK_P3_MODE                0x00000003

/* LINK_INT_CTRL */
#define LINK_IE_STATE_CHG           0x80000000
#define LINK_IE_U1_TOUT             0x40000000
#define LINK_IE_U2_TOUT             0x20000000
#define LINK_IE_UX_FAIL             0x10000000
#define LINK_IE_TX_WARMRST          0x08000000
#define LINK_IE_UX_EXIT_FAIL        0x04000000
#define LINK_IE_RX_LMP_TOUT         0x00800000
#define LINK_IE_TX_LMP              0x00400000
#define LINK_IE_RX_LMP              0x00200000
#define LINK_IE_RX_DET              0x00100000
#define LINK_IE_LOOPBACK            0x00080000
#define LINK_IE_COMPLIANCE          0x00040000
#define LINK_IE_RX_SET_FC           0x00020000
#define LINK_IE_HPBUF_EMPTY         0x00010000
#define LINK_IE_HOT_RST             0x00008000
#define LINK_IE_WAKEUP              0x00004000
#define LINK_IE_WARM_RST            0x00002000
#define LINK_IE_UX_EXIT             0x00001000
#define LINK_IE_TXEQ                0x00000800
#define LINK_IE_TERM_PRES           0x00000400
#define LINK_IE_UX_REJ              0x00000200
#define LINK_IE_U3_WK_TOUT          0x00000100
#define LINK_IE_GO_U0               0x00000080
#define LINK_IE_GO_U1               0x00000040
#define LINK_IE_GO_U2               0x00000020
#define LINK_IE_GO_U3               0x00000010
#define LINK_IE_DISABLE             0x00000008
#define LINK_IE_INACTIVE            0x00000004
#define LINK_IE_RECOVERY            0x00000002
#define LINK_IE_READY               0x00000001

/* LINK_INT_FLAG */
#define LINK_IF_STATE_CHG           0x80000000
#define LINK_IF_U1_TOUT             0x40000000
#define LINK_IF_U2_TOUT             0x20000000
#define LINK_IF_UX_FAIL             0x10000000
#define LINK_IF_TX_WARMRST          0x08000000
#define LINK_IF_UX_EXIT_FAIL        0x04000000
#define LINK_IF_RX_LMP_TOUT         0x00800000
#define LINK_IF_TX_LMP              0x00400000
#define LINK_IF_RX_LMP              0x00200000
#define LINK_IF_RX_DET              0x00100000
#define LINK_IF_LOOPBACK            0x00080000
#define LINK_IF_COMPLIANCE          0x00040000
#define LINK_IF_RX_SET_FC           0x00020000
#define LINK_IF_HPBUF_EMPTY         0x00010000
#define LINK_IF_HOT_RST             0x00008000
#define LINK_IF_WAKEUP              0x00004000
#define LINK_IF_WARM_RST            0x00002000
#define LINK_IF_UX_EXIT             0x00001000
#define LINK_IF_TXEQ                0x00000800
#define LINK_IF_TERM_PRES           0x00000400
#define LINK_IF_UX_REJ              0x00000200
#define LINK_IF_U3_WK_TOUT          0x00000100
#define LINK_IF_GO_U0               0x00000080
#define LINK_IF_GO_U1               0x00000040
#define LINK_IF_GO_U2               0x00000020
#define LINK_IF_GO_U3               0x00000010
#define LINK_IF_DISABLE             0x00000008
#define LINK_IF_INACTIVE            0x00000004
#define LINK_IF_RECOVERY            0x00000002
#define LINK_IF_READY               0x00000001

/* LINK_STATUS */
#define LINK_HPBUF_EMPTY            0x80000000
#define LINK_HPBUF_FULL             0x40000000
#define LINK_HPBUF_IDLE             0x20000000
#define LINK_U3_SLEEP_ALLOW         0x00400000
#define LINK_U2_SLEEP_ALLOW         0x00200000
#define LINK_RXDET_SLEEP_ALLOW      0x00100000
#define LINK_WAKUP                  0x00080000
#define LINK_RX_LFPS                0x00040000
#define LINK_RX_DETECT              0x00020000
#define LINK_RX_UX_EXIT_REQ         0x00010000
#define LINK_STATE_MASK             0x00000F00
 #define LINK_STATE_U0              0x00000000
 #define LINK_STATE_U1              0x00000100
 #define LINK_STATE_U2              0x00000200
 #define LINK_STATE_U3              0x00000300
 #define LINK_STATE_DISABLE         0x00000400
 #define LINK_STATE_RXDET           0x00000500
 #define LINK_STATE_INACTIVE        0x00000600
 #define LINK_STATE_POLLING         0x00000700
 #define LINK_STATE_RECOVERY        0x00000800
 #define LINK_STATE_HOTRST          0x00000900
 #define LINK_STATE_COMPLIANCE      0x00000A00
 #define LINK_STATE_LOOPBACK        0x00000B00
#define LINK_TXEQ                   0x00000040
#define LINK_PD_MODE_ST_MASK        0x00000030
 #define LINK_PD_MODE_ST_P0         0x00000000
 #define LINK_PD_MODE_ST_P1         0x00000010
 #define LINK_PD_MODE_ST_P2         0x00000020
 #define LINK_PD_MODE_ST_P3         0x00000030
#define LINK_READY                  0x00000008
#define LINK_BUSY                   0x00000004
#define LINK_RX_WARM_RST            0x00000002
#define LINK_RX_TERM_PRES           0x00000001

/* LINK_LPM_CR */
#define LINK_LPM_TERM_PRESENT       0x00000800
#define LINK_LPM_TERM_CHG           0x00000400
#define LINK_LPM_EN                 0x00000200
#define LINK_LPM_RST                0x00000100

/* LINK_PORT_CAP */
#define LINK_LMP_RX_CAP_VLD         0x80000000
#define LINK_LMP_TX_CAP_VLD         0x40000000
#define FORCE_PM                    0x20000000 
#define LINK_SPEED_MASK             0x3F000000
#define LINK_PORT_CAP_MASK          0x00FFFFFF

/* USB_CONTROL */
#define USBSS_DEV_ADDR_MASK         0x7F000000
#define USBSS_UIE_FIFO_RXOV         0x00800000           
#define USBSS_UIE_FIFO_TXOV         0x00400000           
#define USBSS_UIE_ITP               0x00100000       
#define USBSS_UIE_RX_PING           0x00080000         
#define USBSS_UDIE_STATUS           0x00040000
#define USBSS_UHIE_NOTIF            0x00040000  
#define USBSS_UDIE_SETUP            0x00020000       
#define USBSS_UHIE_ERDY             0x00020000     
#define USBSS_UIE_TRANSFER          0x00010000           
#define USBSS_CHAIN_CONFLICT        0x00008000               
#define USBSS_TX_ERDY_MODE          0x00004000           
#define USBSS_HP_PEND_MASK          0x00000300    
 #define USBSS_HP_PENDING           0x00000200
#define USBSS_HOST_MODE             0x00000080       
#define USBSS_ITP_EN                0x00000040       
#define USBSS_SETUP_FLOW            0x00000020           
#define USBSS_DIR_ABORT             0x00000010       
#define USBSS_DMA_MODE              0x00000008       
#define USBSS_FORCE_RST             0x00000004       
#define USBSS_USB_CLR_ALL           0x00000002           
#define USBSS_DMA_EN                0x00000001  

/* USB_STATUS */
#define USBSS_HRX_RES_MASK          0xC0000000
#define USBSS_HTX_RES_MASK          0x00C00000
#define USBSS_EP_DIR_MASK           0x00001000
#define USBSS_EP_ID_MASK            0x00000700
#define USBSS_UIF_FIFO_RXOV         0x00000080  
#define USBSS_UIF_FIFO_TXOV         0x00000040           
#define USBSS_UIF_ITP               0x00000010       
#define USBSS_UIF_RX_PING           0x00000008           
#define USBSS_UDIF_STATUS           0x00000004           
#define USBSS_UHIF_NOTIF            0x00000004           
#define USBSS_UDIF_SETUP            0x00000002           
#define USBSS_UHIF_ERDY             0x00000002       
#define USBSS_UIF_TRANSFER          0x00000001   

/* USB_ITP */
#define USBSS_ITP_INTERVAL_MASK     0x00003FFF

/* USB_ITP_ADJ */
#define USBSS_ITP_DELTA             0x001FFF00
#define USBSS_ITP_DELAYED           0x00000080
#define USBSS_ITP_ADJ_CR_MASK       0x0000007F

